#include <stdio.h>

int main() 
{

    /*
    .  Спиращо число
     Напишете програма, която принтира на конзолата 
     всички числа от N до M, които се делят на 2 и на 3 без остатък
     , в обратен ред. От конзолата ще се чете още едно "спиращо" число S.
     Ако някое от делящите се на 2 и 3 числа е равно на спиращото число, 
     то не трябва да се принтира и програмата трябва да приключи. В противен 
     случай се принтират всички числа до N, които отговарят на условието.
     От конзолата се четат 3 числа, всяко на отделен ред:
    •	N - цяло число: 0 ≤ N < M.
    •	M - цяло число: N < M ≤ 10000.
    •	S - цяло число: N ≤ S ≤ M.

    */


    int N, M, S;
    printf("Enter value for N: ");
    scanf_s("%d", &N);
    printf("Enter value for M: ");
    scanf_s("%d", &M);
    printf("Enter value for S: ");
    scanf_s("%d", &S);

    for (int i = M; i >= N; i--)
    {
        if (i % 2 == 0 && i % 3 == 0)
        {
            if (i == S)
            {
                break;
            }
            printf("%d ", i);
        }
    }

}
