

#include <iostream>
#include <math.h>
#include <stdio.h>

//Задача 4: Изчисляване на изрази
//
//Пресметнете стойността на израза :
//
//a)

int main()
{
    double x = 0.5;
    double answer = sqrt(pow(x, 2) - (6 * x) + 9);
    printf("%.2lf", answer);

}

